{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Source](https://inf-ege.sdamgia.ru/problem?id=15097)\n",
    "\n",
    "Логическая функция *F* задаётся выражением *(x ≡ z ) ∨ (x → (y ∧ z))*.\n",
    "\n",
    "Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции *F*.\n",
    "\n",
    "Определите, какому столбцу таблицы истинности соответствует каждая из переменных *x*, *y*, *z*.\n",
    "\n",
    " \n",
    "\n",
    "| Переменная 1 | Переменная 2 | Переменная 3 | Функция |\n",
    "|:------------:|:------------:|:------------:|:-------:|\n",
    "|      ???     |      ???     |      ???     |    F    |\n",
    "|       0      |       0      |              |    0    |\n",
    "|       1      |              |              |    0    |\n",
    " \n",
    "\n",
    "В ответе напишите буквы *x*, *y*, *z* в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.\n",
    "\n",
    " \n",
    "\n",
    "Пример. Пусть задано выражение *x → y*, зависящее от двух переменных *x* и *y*, и фрагмент таблицы истинности:\n",
    "\n",
    " \n",
    "\n",
    "| Переменная 1 | Переменная 2 | Функция |\n",
    "|:------------:|:------------:|:-------:|\n",
    "|      ???     |      ???     |    F    |\n",
    "|       0      |       1      |    0    |\n",
    " \n",
    "\n",
    "Тогда первому столбцу соответствует переменная y, а второму столбцу соответствует переменная *x*. В ответе нужно написать: *yx*."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---+---+---+\n",
      "| x | y | z |\n",
      "+---+---+---+\n",
      "| 1 | 0 | 0 |\n",
      "+---+---+---+\n",
      "| 1 | 1 | 0 |\n",
      "+---+---+---+\n"
     ]
    }
   ],
   "source": [
    "print(\"+---+---+---+\")\n",
    "print(\"| x | y | z |\")\n",
    "print(\"+---+---+---+\")\n",
    "\n",
    "for x in 0, 1:\n",
    "    for y in 0, 1:\n",
    "        for z in 0, 1:\n",
    "            if not ((x == z) or (x <= (y and z))):\n",
    "                print(f\"| {x} | {y} | {z} |\")\n",
    "                print(\"+---+---+---+\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Сопоставим 2 таблицы:\n",
    "\n",
    "1) исходную\n",
    "\n",
    "\n",
    "| Переменная 1 | Переменная 2 | Переменная 3 | Функция |\n",
    "|:------------:|:------------:|:------------:|:-------:|\n",
    "|      ???     |      ???     |      ???     |    F    |\n",
    "|       0      |       0      |              |    0    |\n",
    "|       1      |              |              |    0    |\n",
    "\n",
    "2) Полученную из решения\n",
    "\n",
    "| x | y | z |\n",
    "|---|---|---|\n",
    "| 1 | 0 | 0 |\n",
    "| 1 | 1 | 0 |\n",
    "\n",
    "\n",
    "В таблице, полученной из решения, видно, что первой переменной будет соответствовать *y*, т.к. значения в первой и во второй строках значения совпадают. Соответственно, *z* будет второй переменной, т.к. единственное совпадающее значение. *x* становится последней переменной.\n",
    "\n",
    "Ответ: *yzx*\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
